Revit 2027 API
FabricationService.PaletteCount Property
 The number of palettes in the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PaletteCount { get; }
Public ReadOnly Property PaletteCount As Integer
	Get
public:
property int PaletteCount {
	int get ();
}
member PaletteCount : int with get
Property Value
Int32
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace